fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ВКМ_Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_СписокДоговоров</name>
    <attributes>
      <name>ВКМ_Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДокументРеализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыставленныеКОплатеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
&НаСервере
Функция ВКМ_МассовоеСозданиеАктовПоПериоду(Период,ТабЧасть) экспорт    
	ТЗРеализации = Новый ТаблицаЗначений; 
	ТЗРеализации.Колонки.Добавить("ВКМ_Договор") ;
	ТЗРеализации.Колонки.Добавить("ВКМ_ДокументРеализация");
	Для каждого стр из ТабЧасть Цикл   
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = &Месяц
		|	И РеализацияТоваровУслуг.Договор = &Договор";
		
		Запрос.УстановитьПараметр("Договор", стр.ВКМ_Договор);
		Запрос.УстановитьПараметр("Месяц", МЕсяц(Период));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			НоваяСтрока = ТЗРеализации.Добавить(); 
			НоваяСтрока.ВКМ_Договор = стр.ВКМ_Договор;
			НоваяСтрока.ВКМ_ДокументРеализация = ВыборкаДетальныеЗаписи.Ссылка;
		Иначе
			НовыйДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();  
			ДанныеЗаполнения = Новый Структура; 
			НовыйДокументРеализация.Договор = стр.ВКМ_Договор;
			НовыйДокументРеализация.Организация = стр.ВКМ_Договор.Организация;     
			НовыйДокументРеализация.Ответственный = Пользователи.ТекущийПользователь();
			НовыйДокументРеализация.Дата = ТекущаяДата();   
			//НовыйДокументРеализация.Основание = стр.ВКМ_Основание;
			НовыйДокументРеализация.Контрагент = стр.ВКМ_Договор.Владелец;
            НовыйДокументРеализация.Записать();
			НовыйДокументРеализация.ВКМ_ВыполнитьАвтозаполнение();
			Если НовыйДокументРеализация.ПроверитьЗаполнение() Тогда
				НовыйДокументРеализация.Записать(РежимЗаписиДокумента.Проведение); 
			Иначе
				НовыйДокументРеализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			КонецЕсли;
			НоваяСтрока = ТЗРеализации.Добавить(); 
			НоваяСтрока.ВКМ_Договор = стр.ВКМ_Договор;
			НоваяСтрока.ВКМ_ДокументРеализация = НовыйДокументРеализация.Ссылка;
		КонецЕсли;
	КонецЦикла; 
	возврат ТЗРеализации;
КонецФункции
